tap "cloudentity/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
brew "cryptography"
brew "libyaml"
brew "ansible"
brew "anyenv"
brew "aom"
brew "aria2"
brew "arp-scan"
brew "arping"
brew "aspell"
brew "autossh"
brew "btop"
brew "glib"
brew "cling"
brew "cmake"
brew "colordiff"
brew "docker-compose"
brew "docker-machine", restart_service: :changed
brew "dug"
brew "unbound"
brew "emacs"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "ghq"
brew "git"
brew "gnupg"
brew "go"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "lynx"
brew "mas"
brew "maven"
brew "nano"
brew "nanorc"
brew "nkf"
brew "nmap"
brew "ollama"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "peco"
brew "pipx"
brew "poppler"
brew "pwgen"
brew "qpdf"
brew "qrencode"
brew "rsync"
brew "ruby-build"
brew "rust"
brew "sipcalc"
brew "sl"
brew "sshuttle"
brew "telnet"
brew "testssl"
brew "texlive"
brew "trash", link: true
brew "tree"
brew "unzip"
brew "w3m"
brew "wget"
brew "xdotool"
brew "yt-dlp"
brew "z"
brew "cloudentity/tap/oauth2c"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
cask "android-studio"
cask "brave-browser"
cask "chatgpt"
cask "coconutbattery"
cask "db-browser-for-sqlite"
cask "deckset"
cask "docker"
cask "drawio"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "karabiner-elements"
cask "keepassxc"
cask "libreoffice"
cask "macdown"
cask "macs-fan-control"
cask "obsidian"
cask "qlmarkdown"
cask "skim"
cask "slack"
cask "sourcetree"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
mas "CotEditor", id: 1024640650
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Slack for Desktop", id: 803453959
mas "SnippetsLab", id: 1006087419
mas "ToyViewer", id: 414298354
mas "UTM", id: 1538878817
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "visualstudioexptteam.vscodeintellicode"